<!-- dflook/terraform-github-actions {"workspace":"fix-react","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"515daadcf63f50bd5b7598438bae81e859bb02b9e2cb4e983b109e06a776b203","plan_job_ref":"Job Test plan target and replace #318 at https://github.com/dflook/terraform-github-actions/actions/runs/4079409934","plan_hash":"de97b1e36a2ddc89752a9d87ba3c5c7aa0beff597a973cc465fabc51a1f59062","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-react__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "3U8SLzo8ML" -> (known after apply)
  ~ foreach = "EHJGbt7bf8" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #318](https://github.com/dflook/terraform-github-actions/actions/runs/4079409934)